feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/iLLD/TC37A/Tricore/Msc/Std/IfxMsc.h
/** \brief Downstream Timing Extension Register - Passive Phase Length at Control Frames Extension\n
 * Definition in Ifx_MSC.DSTE.B.PPCE
 */
typedef enum
{
    IfxMsc_ControlFrameExtensionPassivePhaseLength_0 = 0,      /**< \brief Length of Command frames passive phase is  2  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_1,          /**< \brief Length of Command frames passive phase is  3  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_2,          /**< \brief Length of Command frames passive phase is  4  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_3,          /**< \brief Length of Command frames passive phase is  5  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_4,          /**< \brief Length of Command frames passive phase is  6  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_5,          /**< \brief Length of Command frames passive phase is  7  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_6,          /**< \brief Length of Command frames passive phase is  8  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_7,          /**< \brief Length of Command frames passive phase is  9  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_8,          /**< \brief Length of Command frames passive phase is  10  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_9,          /**< \brief Length of Command frames passive phase is  11  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_10,         /**< \brief Length of Command frames passive phase is  12  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_11,         /**< \brief Length of Command frames passive phase is  13  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_12,         /**< \brief Length of Command frames passive phase is  14  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_13,         /**< \brief Length of Command frames passive phase is  15  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_14,         /**< \brief Length of Command frames passive phase is  16  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_15,         /**< \brief Length of Command frames passive phase is  17  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_16,         /**< \brief Length of Command frames passive phase is  18  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_17,         /**< \brief Length of Command frames passive phase is  19  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_18,         /**< \brief Length of Command frames passive phase is  20  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_19,         /**< \brief Length of Command frames passive phase is  21  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_20,         /**< \brief Length of Command frames passive phase is  22  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_21,         /**< \brief Length of Command frames passive phase is  23  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_22,         /**< \brief Length of Command frames passive phase is  24  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_23,         /**< \brief Length of Command frames passive phase is  25  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_24,         /**< \brief Length of Command frames passive phase is  26  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_25,         /**< \brief Length of Command frames passive phase is  27  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_26,         /**< \brief Length of Command frames passive phase is  28  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_27,         /**< \brief Length of Command frames passive phase is  29  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_28,         /**< \brief Length of Command frames passive phase is  30  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_29,         /**< \brief Length of Command frames passive phase is  31  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_30,         /**< \brief Length of Command frames passive phase is  32  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_31,         /**< \brief Length of Command frames passive phase is  33  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_32,         /**< \brief Length of Command frames passive phase is  34  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_33,         /**< \brief Length of Command frames passive phase is  35  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_34,         /**< \brief Length of Command frames passive phase is  36  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_35,         /**< \brief Length of Command frames passive phase is  37  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_36,         /**< \brief Length of Command frames passive phase is  38  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_37,         /**< \brief Length of Command frames passive phase is  39  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_38,         /**< \brief Length of Command frames passive phase is  40  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_39,         /**< \brief Length of Command frames passive phase is  41  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_40,         /**< \brief Length of Command frames passive phase is  42  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_41,         /**< \brief Length of Command frames passive phase is  43  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_42,         /**< \brief Length of Command frames passive phase is  44  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_43,         /**< \brief Length of Command frames passive phase is  45  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_44,         /**< \brief Length of Command frames passive phase is  46  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_45,         /**< \brief Length of Command frames passive phase is  47  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_46,         /**< \brief Length of Command frames passive phase is  48  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_47,         /**< \brief Length of Command frames passive phase is  49  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_48,         /**< \brief Length of Command frames passive phase is  50  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_49,         /**< \brief Length of Command frames passive phase is  51  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_50,         /**< \brief Length of Command frames passive phase is  52  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_51,         /**< \brief Length of Command frames passive phase is  53  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_52,         /**< \brief Length of Command frames passive phase is  54  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_53,         /**< \brief Length of Command frames passive phase is  55  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_54,         /**< \brief Length of Command frames passive phase is  56  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_55,         /**< \brief Length of Command frames passive phase is  57  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_56,         /**< \brief Length of Command frames passive phase is  58  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_57,         /**< \brief Length of Command frames passive phase is  59  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_58,         /**< \brief Length of Command frames passive phase is  60  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_59,         /**< \brief Length of Command frames passive phase is  61  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_60,         /**< \brief Length of Command frames passive phase is  62  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_61,         /**< \brief Length of Command frames passive phase is  63  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_62,         /**< \brief Length of Command frames passive phase is  64  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_63,         /**< \brief Length of Command frames passive phase is  65  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_64,         /**< \brief Length of Command frames passive phase is  66  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_65,         /**< \brief Length of Command frames passive phase is  67  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_66,         /**< \brief Length of Command frames passive phase is  68  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_67,         /**< \brief Length of Command frames passive phase is  69  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_68,         /**< \brief Length of Command frames passive phase is  70  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_69,         /**< \brief Length of Command frames passive phase is  71  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_70,         /**< \brief Length of Command frames passive phase is  72  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_71,         /**< \brief Length of Command frames passive phase is  73  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_72,         /**< \brief Length of Command frames passive phase is  74  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_73,         /**< \brief Length of Command frames passive phase is  75  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_74,         /**< \brief Length of Command frames passive phase is  76  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_75,         /**< \brief Length of Command frames passive phase is  77  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_76,         /**< \brief Length of Command frames passive phase is  78  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_77,         /**< \brief Length of Command frames passive phase is  79  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_78,         /**< \brief Length of Command frames passive phase is  80  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_79,         /**< \brief Length of Command frames passive phase is  81  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_80,         /**< \brief Length of Command frames passive phase is  82  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_81,         /**< \brief Length of Command frames passive phase is  83  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_82,         /**< \brief Length of Command frames passive phase is  84  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_83,         /**< \brief Length of Command frames passive phase is  85  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_84,         /**< \brief Length of Command frames passive phase is  86  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_85,         /**< \brief Length of Command frames passive phase is  87  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_86,         /**< \brief Length of Command frames passive phase is  88  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_87,         /**< \brief Length of Command frames passive phase is  89  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_88,         /**< \brief Length of Command frames passive phase is  90  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_89,         /**< \brief Length of Command frames passive phase is  91  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_90,         /**< \brief Length of Command frames passive phase is  92  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_91,         /**< \brief Length of Command frames passive phase is  93  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_92,         /**< \brief Length of Command frames passive phase is  94  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_93,         /**< \brief Length of Command frames passive phase is  95  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_94,         /**< \brief Length of Command frames passive phase is  96  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_95,         /**< \brief Length of Command frames passive phase is  97  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_96,         /**< \brief Length of Command frames passive phase is  98  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_97,         /**< \brief Length of Command frames passive phase is  99  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_98,         /**< \brief Length of Command frames passive phase is  100  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_99,         /**< \brief Length of Command frames passive phase is  101  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_100,        /**< \brief Length of Command frames passive phase is  102  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_101,        /**< \brief Length of Command frames passive phase is  103  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_102,        /**< \brief Length of Command frames passive phase is  104  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_103,        /**< \brief Length of Command frames passive phase is  105  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_104,        /**< \brief Length of Command frames passive phase is  106  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_105,        /**< \brief Length of Command frames passive phase is  107  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_106,        /**< \brief Length of Command frames passive phase is  108  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_107,        /**< \brief Length of Command frames passive phase is  109  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_108,        /**< \brief Length of Command frames passive phase is  110  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_109,        /**< \brief Length of Command frames passive phase is  111  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_110,        /**< \brief Length of Command frames passive phase is  112  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_111,        /**< \brief Length of Command frames passive phase is  113  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_112,        /**< \brief Length of Command frames passive phase is  114  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_113,        /**< \brief Length of Command frames passive phase is  115  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_114,        /**< \brief Length of Command frames passive phase is  116  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_115,        /**< \brief Length of Command frames passive phase is  117  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_116,        /**< \brief Length of Command frames passive phase is  118  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_117,        /**< \brief Length of Command frames passive phase is  119  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_118,        /**< \brief Length of Command frames passive phase is  120  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_119,        /**< \brief Length of Command frames passive phase is  121  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_120,        /**< \brief Length of Command frames passive phase is  122  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_121,        /**< \brief Length of Command frames passive phase is  123  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_122,        /**< \brief Length of Command frames passive phase is  124  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_123,        /**< \brief Length of Command frames passive phase is  125  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_124,        /**< \brief Length of Command frames passive phase is  126  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_125,        /**< \brief Length of Command frames passive phase is  127  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_126,        /**< \brief Length of Command frames passive phase is  128  */
    IfxMsc_ControlFrameExtensionPassivePhaseLength_127         /**< \brief Length of Command frames passive phase is  129  */
} IfxMsc_ControlFrameExtensionPassivePhaseLength;

/** \brief Downstream Timing Extension Register - Passive Phase Length at Data Frames Extension\n
 * Definition in Ifx_MSC.DSTE.B.PPDE
 */
typedef enum
{
    IfxMsc_DataFrameExtensionPassivePhaseLength_0 = 0,      /**< \brief 0 Additional MSB bits extension of the PPD bit field  */
    IfxMsc_DataFrameExtensionPassivePhaseLength_1,          /**< \brief 1 Additional MSB bits extension of the PPD bit field  */
    IfxMsc_DataFrameExtensionPassivePhaseLength_2,          /**< \brief 2 Additional MSB bits extension of the PPD bit field  */
    IfxMsc_DataFrameExtensionPassivePhaseLength_3           /**< \brief 3 Additional MSB bits extension of the PPD bit field  */
} IfxMsc_DataFrameExtensionPassivePhaseLength;

/** \brief Interrupt Control Register - Data Frame Interrupt Enable\n
 * Definition in Ifx_MSC.ICR.B.EDIE
 */
typedef enum
{
    IfxMsc_DataFrameInterrupt_disabled       = 0, /**< \brief Interrupt generation Disable */
    IfxMsc_DataFrameInterrupt_atLastDataBit  = 1, /**< \brief An interrupt is generated when the last data bit has been shifted out */
    IfxMsc_DataFrameInterrupt_atFirstDataBit = 2  /**< \brief An interrupt is generated when the First data bit has been shifted out */
} IfxMsc_DataFrameInterrupt;

/** \brief Interrupt Control Register - Data Frame Interrupt Node Pointer\n
 * Definition in Ifx_MSC.ICR.B.EDIP
 */
typedef enum
{
    IfxMsc_DataFrameInterruptNode_SR0 = 0,      /**< \brief Service request output SR0 selected  */
    IfxMsc_DataFrameInterruptNode_SR1,          /**< \brief Service request output SR1 selected  */
    IfxMsc_DataFrameInterruptNode_SR2,          /**< \brief Service request output SR2 selected  */
    IfxMsc_DataFrameInterruptNode_SR3           /**< \brief Service request output SR3 selected  */
} IfxMsc_DataFrameInterruptNode;

