feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/iLLD/TC37A/Tricore/Msc/Std/IfxMsc.h
/** \brief Enables the Upstream Timeout Interrupt
 * \param msc pointer to the base of MSC registers
 * \return None
 */
IFX_INLINE void IfxMsc_enableUpstreamTimeoutInterrupt(Ifx_MSC *msc);

/** \brief Returns the value of Asynchronous clock Bypass bit.
 * \param msc pointer to the base of MSC registers
 * \return Get the value of Asynchronous clock bypass enable bit.
 */
IFX_INLINE boolean IfxMsc_getAsyncClockBypass(Ifx_MSC *msc);

/** \brief Returns the value of Down stream extension enable bit.
 * \param msc pointer to the base of MSC registers
 * \return Get the value of Down stream extension enable bit.
 */
IFX_INLINE boolean IfxMsc_getDownStreamExtension(Ifx_MSC *msc);

/** \brief Returns the Recieve DataInterrupt Flag Status
 * \param msc pointer to the base of MSC registers
 * \return Status
 */
IFX_INLINE boolean IfxMsc_getRecieveDataInterruptFlag(Ifx_MSC *msc);

/** \brief Returns the Src pointer for the selected MSC interrupt node
 * \param msc pointer to the base of MSC registers
 * \param intRequest Interrupt Request
 * \return Pointer to SRCR register
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxMsc_getSrcPointer(Ifx_MSC *msc, IfxMsc_InterruptServiceRequest intRequest);

/** \brief Returns the Upstream Data
 * \param msc pointer to the base of MSC registers
 * \param upstreamIdx upstream index
 * \return Upstream Data
 */
IFX_INLINE uint32 IfxMsc_getUpstreamData(Ifx_MSC *msc, uint8 upstreamIdx);

/** \brief Returns the Upstream Parity Error Flag Status
 * \param msc pointer to the base of MSC registers
 * \param upstreamIdx upstream index
 * \return Status
 */
IFX_INLINE boolean IfxMsc_getUpstreamParityErrorFlag(Ifx_MSC *msc, uint8 upstreamIdx);

/** \brief Returns Upstream Timeout Flag Status
 * \param msc pointer to the base of MSC registers
 * \return Status
 */
IFX_INLINE boolean IfxMsc_getUpstreamTimeoutFlag(Ifx_MSC *msc);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param msc Pointer to MSC module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxMsc_isModuleSuspended(Ifx_MSC *msc);

/** \brief Set or reset the Asynchronous clock bypass bit.
 * \param msc pointer to the base of MSC registers
 * \param value Set / reset value.
 * \return None
 */
IFX_INLINE void IfxMsc_setAsyncClockBypass(Ifx_MSC *msc, boolean value);

/** \brief Sets the Down stream data
 * \param msc pointer to the base of MSC registers
 * \param data Data
 * \return None
 */
IFX_INLINE void IfxMsc_setDownStreamData(Ifx_MSC *msc, uint32 data);

/** \brief Set or reset the Down stream extension enable bit.
 * \param msc pointer to the base of MSC registers
 * \param value Set / reset value.
 * \return None
 */
IFX_INLINE void IfxMsc_setDownStreamExtension(Ifx_MSC *msc, boolean value);

/** \brief Sets the Down stream Extension data
 * \param msc pointer to the base of MSC registers
 * \param data Data
 * \return None
 */
IFX_INLINE void IfxMsc_setDownStreamExtensionData(Ifx_MSC *msc, uint32 data);

/** \brief Set or reset the Fast Mode bit.
 * Select the correct NDD value when using Fast mode.
 * \param msc pointer to the base of MSC registers
 * \param value Set / reset value.
 * \return None
 */
IFX_INLINE void IfxMsc_setFastMode(Ifx_MSC *msc, boolean value);

/** \brief Sets The Fractional Divider Step
 * \param msc pointer to the base of MSC registers
 * \param value Value
 * \return None
 */
IFX_INLINE void IfxMsc_setFractionalDividerStep(Ifx_MSC *msc, uint16 value);

/** \brief Set the required N divider downstream value.
 * \param msc pointer to the base of MSC registers
 * \param divisionRatio select the required division ratio.
 * \return None
 */
IFX_INLINE void IfxMsc_setNdividerDownstream(Ifx_MSC *msc, IfxMsc_NDividerDownstream divisionRatio);

/** \brief To enable or disable CX mode
 * \param msc
 * \param value To enable or disable CX mode
 * \return None
 */
IFX_INLINE void IfxMsc_setResetCommandExtensionMode(Ifx_MSC *msc, boolean value);

/** \brief Sets The Serial Data Input Select
 * \param msc pointer to the base of MSC registers
 * \param select Serial Data Input Select
 * \return None
 */
IFX_INLINE void IfxMsc_setSerialDataInputSelect(Ifx_MSC *msc, IfxMsc_SerialDataInput select);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param msc pointer to MSC registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxMsc_setSleepMode(Ifx_MSC *msc, IfxMsc_SleepMode mode);

/** \brief Configure the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param msc Pointer to MSC module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxMsc_setSuspendMode(Ifx_MSC *msc, IfxMsc_SuspendMode mode);

/** \brief Sets the Transmission Mode
 * \param msc pointer to the base of MSC registers
 * \param mode mode
 * \return None
 */
IFX_INLINE void IfxMsc_setTransmissionMode(Ifx_MSC *msc, IfxMsc_TransmissionMode mode);

/** \brief Sets The Upstream Channel Recieve Rate
 * \param msc pointer to the base of MSC registers
 * \param recieveRate Recieve Rate
 * \return None
 */
IFX_INLINE void IfxMsc_setUpstreamChannelRecieveRate(Ifx_MSC *msc, IfxMsc_UpstreamChannelReceivingRate recieveRate);

/** \brief Sets The Upstream Timeout
 * \param msc pointer to the base of MSC registers
 * \param timeoutVal Timeout Value
 * \return None
 */
IFX_INLINE void IfxMsc_setUpstreamTimeout(Ifx_MSC *msc, IfxMsc_UpstreamTimeoutValue timeoutVal);

/** \brief Sets The Upstream Timeout Prescalar
 * \param msc pointer to the base of MSC registers
 * \param prescalar prescalar
 * \return None
 */
IFX_INLINE void IfxMsc_setUpstreamTimeoutPrescalar(Ifx_MSC *msc, IfxMsc_UpstreamTimeoutPrescaler prescalar);

/** \brief Indicates if Overflow error has occured
 * \param msc Pointer to MSC SFR base address
 * \return Returns overflow error status
 */
IFX_INLINE boolean IfxMsc_hasAbraOverflowErrorOccured(Ifx_MSC *msc);

/** \brief Indicates if Underflow error has occured
 * \param msc Pointer to MSC SFR base address
 * \return Returns underflow error status
 */
IFX_INLINE boolean IfxMsc_hasAbraUnderflowErrorOccured(Ifx_MSC *msc);

