feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/iLLD/TC37A/Tricore/Msc/Std/IfxMsc.h
IFX_INLINE void IfxMsc_initInjPin(const IfxMsc_Inj_In *inj, IfxPort_InputMode pinMode, IfxPort_PadDriver padDriver)
{
    if (inj->pin.port != NULL_PTR)
    {
        IfxPort_setPinModeInput(inj->pin.port, inj->pin.pinIndex, pinMode);
        IfxPort_setPinPadDriver(inj->pin.port, inj->pin.pinIndex, padDriver);
    }
}


IFX_INLINE void IfxMsc_initSdiPin(const IfxMsc_Sdi_In *sdi, IfxPort_InputMode pinMode, IfxPort_PadDriver padDriver)
{
    if (sdi->pin.port != NULL_PTR)
    {
        IfxPort_setPinModeInput(sdi->pin.port, sdi->pin.pinIndex, pinMode);
        IfxPort_setPinPadDriver(sdi->pin.port, sdi->pin.pinIndex, padDriver);
        sdi->module->OCR.B.SDISEL = sdi->select;
    }
}


IFX_INLINE void IfxMsc_initSonPin(const IfxMsc_Son_Out *son, IfxPort_OutputMode pinMode, IfxPort_PadDriver padDriver)
{
    if (son->pin.port != NULL_PTR)
    {
        IfxPort_setPinModeOutput(son->pin.port, son->pin.pinIndex, pinMode, son->select);
        IfxPort_setPinPadDriver(son->pin.port, son->pin.pinIndex, padDriver);
    }
}


IFX_INLINE void IfxMsc_initSopPin(const IfxMsc_Sop_Out *sop, IfxPort_OutputMode pinMode, IfxPort_PadDriver padDriver)
{
    if (sop->pin.port != NULL_PTR)
    {
        IfxPort_setPinModeOutput(sop->pin.port, sop->pin.pinIndex, pinMode, sop->select);
        IfxPort_setPinPadDriver(sop->pin.port, sop->pin.pinIndex, padDriver);
    }
}


IFX_INLINE boolean IfxMsc_isModuleSuspended(Ifx_MSC *msc)
{
    Ifx_MSC_OCS ocs;

    // read the status
    ocs.U = msc->OCS.U;

    // return the status
    return ocs.B.SUSSTA;
}


IFX_INLINE void IfxMsc_setAsyncClockBypass(Ifx_MSC *msc, boolean value)
{
    msc->ABC.B.ABB = value;
}


IFX_INLINE void IfxMsc_setCommandTarget(Ifx_MSC *msc, IfxMsc_Target enX)
{
    /* Set command target - en0, en1, en2 or en3 */
    msc->OCR.B.CSC = enX;
}


IFX_INLINE void IfxMsc_setDataHighTarget(Ifx_MSC *msc, IfxMsc_Target enX)
{
    /* Set data high target - en0, en1, en2 or en3 */
    msc->OCR.B.CSH = enX;
}


IFX_INLINE void IfxMsc_setDataLowTarget(Ifx_MSC *msc, IfxMsc_Target enX)
{
    /* Set data low target - en0, en1, en2 or en3 */
    msc->OCR.B.CSL = enX;
}


IFX_INLINE void IfxMsc_setDownStreamData(Ifx_MSC *msc, uint32 data)
{
    msc->DD.U = data;
}


IFX_INLINE void IfxMsc_setDownStreamExtension(Ifx_MSC *msc, boolean value)
{
    msc->DSCE.B.EXEN = value;
}


IFX_INLINE void IfxMsc_setDownStreamExtensionData(Ifx_MSC *msc, uint32 data)
{
    msc->DDE.U = data;
}


IFX_INLINE void IfxMsc_setFastMode(Ifx_MSC *msc, boolean value)
{
    uint32 bit_pattern;
    uint32 mask = 0x80010000; // Mask to clear the bits(FM & UL1)

    if (value == 1)
    {
        /*set the fast mode bit */
        bit_pattern = 0x80010000; // bit pattern(UL1=1 and FM=1) for activating Fast Mode.It's written with DTSE.U access instead of DTSE.B.<individual_bit_fields> as both UL1 & FM bit fields have to be written at once.
    }
    else
    {
        /*reset the fast mode bit */
        bit_pattern = 0x80000000; // bit pattern(UL1=1 and FM=0) bit pattern for deactivating Fast Mode.It's written with DTSE.U access instead of DTSE.B.<individual_bit_fields> as both UL1 & FM bit fields have to be written at once.
    }

    msc->DSTE.U = (msc->DSTE.U & ~mask) | bit_pattern;
}


IFX_INLINE void IfxMsc_setFractionalDividerStep(Ifx_MSC *msc, uint16 value)
{
    uint16 passwd = IfxScuWdt_getCpuWatchdogPassword();
    IfxScuWdt_clearCpuEndinit(passwd);

    msc->FDR.B.DISCLK = 1;      /* Disable MSC clock*/

    while (msc->FDR.B.DISCLK != 1)
    {}

    /* Configure the DIVIDER STEP */
    msc->FDR.B.STEP   = value;
    msc->FDR.B.DISCLK = 0;      /* Enable MSC clock */

    while (msc->FDR.B.DISCLK != 0)
    {}

    IfxScuWdt_setCpuEndinit(passwd);
}


IFX_INLINE void IfxMsc_setNdividerDownstream(Ifx_MSC *msc, IfxMsc_NDividerDownstream divisionRatio)
{
    msc->DSTE.B.NDD = divisionRatio;
}


IFX_INLINE void IfxMsc_setResetCommandExtensionMode(Ifx_MSC *msc, boolean value)
{
    uint32 bit_pattern;
    uint32 mask = 0x90000000; // Mask to clear the bits(CX & UL1)

    if (value == 1)
    {
        bit_pattern = 0x90000000; // bit pattern(UL1=1 and CX=1) for activating Command Extension Mode.It's written with DTSE.U access instead of DTSE.B.<individual_bit_fields> as both UL1 & CX bit fields have to be written at once( in a single cycle).
    }
    else
    {
        bit_pattern = 0x80000000; // bit pattern(UL1=1 and CX=0) bit pattern for deactivating Command Extension Mode.It's written with DTSE.U access instead of DTSE.B.<individual_bit_fields> as both UL1 & CX bit fields have to be written at once.
    }

    msc->DSTE.U = (msc->DSTE.U & ~mask) | bit_pattern;
}


IFX_INLINE void IfxMsc_setSerialDataInputSelect(Ifx_MSC *msc, IfxMsc_SerialDataInput select)
{
    msc->OCR.B.SDISEL = select;
}


IFX_INLINE void IfxMsc_setSleepMode(Ifx_MSC *msc, IfxMsc_SleepMode mode)
{
    uint16 passwd = IfxScuWdt_getCpuWatchdogPassword();
    IfxScuWdt_clearCpuEndinit(passwd);
    msc->CLC.B.EDIS = mode;
    IfxScuWdt_setCpuEndinit(passwd);
}


IFX_INLINE void IfxMsc_setSuspendMode(Ifx_MSC *msc, IfxMsc_SuspendMode mode)
{
    Ifx_MSC_OCS ocs;

    // remove protection and configure the suspend mode.
    ocs.B.SUS_P = 1;
    ocs.B.SUS   = mode;
    msc->OCS.U  = ocs.U;
}


IFX_INLINE void IfxMsc_setTransmissionMode(Ifx_MSC *msc, IfxMsc_TransmissionMode mode)
{
    msc->DSC.B.TM = mode;
}


IFX_INLINE void IfxMsc_setUpstreamChannelRecieveRate(Ifx_MSC *msc, IfxMsc_UpstreamChannelReceivingRate recieveRate)
{
    msc->USR.B.URR = recieveRate;
}


IFX_INLINE void IfxMsc_setUpstreamTimeout(Ifx_MSC *msc, IfxMsc_UpstreamTimeoutValue timeoutVal)
{
    msc->USCE.B.USTOVAL = timeoutVal;
}


IFX_INLINE void IfxMsc_setUpstreamTimeoutPrescalar(Ifx_MSC *msc, IfxMsc_UpstreamTimeoutPrescaler prescalar)
{
    msc->USCE.B.USTOPRE = prescalar;
}


IFX_INLINE boolean IfxMsc_hasAbraOverflowErrorOccured(Ifx_MSC *msc)
{
    return msc->ABC.B.OVF == 1U;
}


IFX_INLINE boolean IfxMsc_hasAbraUnderflowErrorOccured(Ifx_MSC *msc)
{
    return msc->ABC.B.UNF == 1U;
}


IFX_INLINE void IfxMsc_setAbraOverflowFlag(Ifx_MSC *msc)
{
    /* Set Overflow Flag */
    msc->ABC.B.OFM = 1U;
}


IFX_INLINE void IfxMsc_setAbraUnderflowFlag(Ifx_MSC *msc)
{
    /* Set Underflow Flag */
    msc->ABC.B.UFM = 1U;
}


#endif /* IFXMSC_H */
